[
  {
    "id": "1",
    "slug": "prime-minister-visit",
    "title": {
      "en": "The Visit of the Prime Minister and the Governor of Port Said",
      "ar": "زيارة رئيس الوزراء ومحافظ بورسعيد"
    },
    "excerpt": {
      "en": "The Prime Minister inspects the Edge factory for ready-to-wear clothes in Port Said.",
      "ar": "رئيس الوزراء يتفقد مصنع إيدج للملابس الجاهزة في بورسعيد."
    },
    "content": {
      "en": "The Prime Minister inspects the \"Edge\" factory for ready-to-wear clothes in Port Said, and holds discussions with workers. The Governor of Port Said expressed great pride in the youth of the industrial communities after their success in conquering global markets with their products.\n\nDuring his visit to Port Said governorate, Dr. Mustafa Madbouly, Prime Minister, along with his accompanying delegation and Major General Adel Ghadhban, Governor of Port Said, inspected the \"Edge\" factory for ready-to-wear clothes.\n\n\"Work began in the factory in 2016 with 200 workers. Production has reached 900,000 trousers annually. Part of the production is exported to Europe and the United States, while the remaining part is sold in local markets.\"\n\nDuring his tour, the Prime Minister had conversations with factory workers. One female worker shared that she obtained a prep certificate and has worked at the factory for a year, with transportation provided by the factory. Another worker mentioned he has been working for two years with a monthly salary of 2,800 pounds.\n\nWhen asked about their requests, workers expressed satisfaction with the job opportunities provided by such factories. The Prime Minister confirmed that every factory established in Egypt opens homes and provides a decent life for Egyptian workers.\n\nMajor General Adel Al-Ghadhban confirmed that the youth of the 58 factory project and the 54 factories have proven their worth by successfully entering international markets shortly after receiving the factories. He noted that the governorate provides all means of support for serious investors who work to provide job opportunities for youth.",
      "ar": "يتفقد رئيس الوزراء مصنع \"إيدج\" للملابس الجاهزة في بورسعيد، ويجري نقاشات مع العمال. أعرب محافظ بورسعيد عن فخره الكبير بشباب المجتمعات الصناعية بعد نجاحهم في غزو الأسواق العالمية بمنتجاتهم.\n\nخلال زيارته لمحافظة بورسعيد، قام الدكتور مصطفى مدبولي رئيس الوزراء، برفقة الوفد المرافق له واللواء عادل الغضبان محافظ بورسعيد، بتفقد مصنع \"إيدج\" للملابس الجاهزة.\n\n\"بدأ العمل في المصنع عام 2016 بـ 200 عامل. وصل الإنتاج إلى 900 ألف بنطلون سنوياً. يتم تصدير جزء من الإنتاج إلى أوروبا والولايات المتحدة، بينما يُطرح الجزء المتبقي في الأسواق المحلية.\"\n\nخلال جولته، أجرى رئيس الوزراء محادثات مع عمال المصنع. شاركت إحدى العاملات أنها حصلت على شهادة إعدادية وتعمل في المصنع منذ عام، مع توفير المصنع لوسائل النقل. وذكر عامل آخر أنه يعمل منذ عامين براتب شهري 2800 جنيه.\n\nعند سؤالهم عن طلباتهم، أعرب العمال عن رضاهم عن فرص العمل التي توفرها مثل هذه المصانع. وأكد رئيس الوزراء أن كل مصنع يُقام في مصر يفتح بيوتاً ويوفر حياة كريمة للعمال المصريين.\n\nأكد اللواء عادل الغضبان أن شباب مشروع الـ 58 مصنعاً والـ 54 مصنعاً أثبتوا جدارتهم بنجاحهم في دخول الأسواق الدولية بعد فترة وجيزة من استلامهم المصانع. مشيراً إلى أن المحافظة توفر كل سبل الدعم للمستثمر الجاد الذي يعمل على توفير فرص العمل للشباب."
    },
    "date": "December 16, 2020",
    "category": {
      "en": "News",
      "ar": "أخبار"
    },
    "image": "https://edgeforgarments.com/wp-content/uploads/2020/11/125231717_230544125072450_6821586552934938452_n.jpg",
    "gallery": [
      "https://edgeforgarments.com/wp-content/uploads/2020/11/124952895_230544231739106_7908619298259705222_n-300x181.jpg",
      "https://edgeforgarments.com/wp-content/uploads/2020/11/125326618_230544251739104_7114983533161462777_n-300x260.jpg",
      "https://edgeforgarments.com/wp-content/uploads/2020/11/124843056_230544311739098_4605908590755395276_n.jpg"
    ],
    "featured": true
  },
  {
    "id": "2",
    "slug": "committee-visit",
    "title": {
      "en": "The Visit of the Distinguished Members of the Esteemed Committee",
      "ar": "زيارة الأعضاء المتميزين من اللجنة الموقرة"
    },
    "excerpt": {
      "en": "The visit on the occasion of the inauguration of the new Edge Garment Factory.",
      "ar": "زيارة بمناسبة افتتاح مصنع إيدج الجديد للملابس."
    },
    "content": {
      "en": "The visit of the distinguished members of the esteemed committee, which had the merit after God Almighty in choosing the owners of the 58 factories.\n\nThis visit was on the occasion of the inauguration of the new Edge Garment Factory in the 118 Factory Complex.\n\nThis momentous occasion marked a significant milestone in our journey of growth and expansion. The committee members toured the facility, observing our state-of-the-art production lines and meeting with our dedicated workforce.\n\nThe inauguration ceremony was attended by key stakeholders and industry leaders, all of whom expressed their confidence in Edge Garments' commitment to quality and excellence in the garment manufacturing sector.",
      "ar": "زيارة الأعضاء المتميزين من اللجنة الموقرة، التي كان لها الفضل بعد الله تعالى في اختيار أصحاب مصانع الـ 58 مصنعاً.\n\nجاءت هذه الزيارة بمناسبة افتتاح مصنع إيدج الجديد للملابس في مجمع الـ 118 مصنعاً.\n\nشكلت هذه المناسبة الهامة علامة فارقة في رحلة نمونا وتوسعنا. قام أعضاء اللجنة بجولة في المنشأة، ولاحظوا خطوط الإنتاج الحديثة والتقوا بالقوى العاملة المتفانية.\n\nحضر حفل الافتتاح أصحاب المصلحة الرئيسيون وقادة الصناعة، وأعربوا جميعاً عن ثقتهم في التزام إيدج للملابس بالجودة والتميز في قطاع تصنيع الملابس."
    },
    "date": "December 16, 2020",
    "category": {
      "en": "News",
      "ar": "أخبار"
    },
    "image": "https://edgeforgarments.com/wp-content/uploads/2020/12/87313942_157047515755445_671847753994731520_o.jpg",
    "gallery": [
      "https://edgeforgarments.com/wp-content/uploads/2020/12/87768389_157047709088759_3543045778056413184_o-300x225.jpg"
    ],
    "featured": false
  },
  {
    "id": "3",
    "slug": "governor-visit",
    "title": {
      "en": "The Visit of Major General Adel Ghadhban, Governor of Port Said",
      "ar": "زيارة اللواء عادل الغضبان محافظ بورسعيد"
    },
    "excerpt": {
      "en": "The visit of the Governor to the Edge Factory for Ready-Made Garments.",
      "ar": "زيارة المحافظ لمصنع إيدج للملابس الجاهزة."
    },
    "content": {
      "en": "The visit of Major General Adel Ghadhban, Governor of Port Said, to the Edge Factory for Ready-Made Garments on February 18, 2020.\n\nDuring his visit, the Governor toured the production facilities and met with factory management to discuss the company's contribution to the local economy and employment opportunities for the youth of Port Said.\n\nThe Governor expressed his appreciation for the quality of work being produced at the facility and commended the management for their commitment to providing stable employment for local workers.\n\nThis visit underscored the strong relationship between Edge Garments and the local government, highlighting our role as a key contributor to the industrial development of the Port Said region.",
      "ar": "زيارة اللواء عادل الغضبان محافظ بورسعيد لمصنع إيدج للملابس الجاهزة في 18 فبراير 2020.\n\nخلال زيارته، قام المحافظ بجولة في مرافق الإنتاج والتقى بإدارة المصنع لمناقشة مساهمة الشركة في الاقتصاد المحلي وفرص العمل لشباب بورسعيد.\n\nأعرب المحافظ عن تقديره لجودة العمل المنتج في المنشأة وأشاد بالإدارة لالتزامها بتوفير عمل مستقر للعمال المحليين.\n\nأكدت هذه الزيارة على العلاقة القوية بين إيدج للملابس والحكومة المحلية، مما يسلط الضوء على دورنا كمساهم رئيسي في التنمية الصناعية لمنطقة بورسعيد."
    },
    "date": "November 12, 2020",
    "category": {
      "en": "News",
      "ar": "أخبار"
    },
    "image": "https://edgeforgarments.com/wp-content/uploads/2020/11/87025445_1791634644305092_4180343608236310528_n.jpg",
    "gallery": [
      "https://edgeforgarments.com/wp-content/uploads/2020/11/86842068_1791634127638477_8843948724641071104_n.jpg",
      "https://edgeforgarments.com/wp-content/uploads/2020/11/86490451_1791634260971797_7128620348047622144_n.jpg",
      "https://edgeforgarments.com/wp-content/uploads/2020/11/86725992_1791634370971786_6716494201359433728_n.jpg"
    ],
    "featured": false
  }
]
